{
  "feature_title": "Registro automático de logs para peticiones HTTP exitosas",
  "description": "Implementar un sistema que registre automáticamente logs con nivel INFO cuando ocurran peticiones HTTP exitosas (códigos 2xx). El sistema debe interceptar todas las peticiones exitosas, extraer información relevante (URL, método HTTP, status code, tiempo de respuesta, etc.) y registrar el log de forma asíncrona usando el LogsClientService existente.",
  "tasks": [
    {
      "id": "T01",
      "title": "Crear interceptor HTTP para registro de logs de peticiones exitosas",
      "description": "Crear `SuccessfulRequestLoggingInterceptor` que implemente `HandlerInterceptor` para interceptar peticiones HTTP exitosas. El interceptor debe: implementar `afterCompletion` para capturar peticiones exitosas (status 2xx), extraer información relevante de la request (URL, método HTTP, query params si aplica), calcular tiempo de respuesta, extraer información del usuario si está disponible (desde request attributes), y llamar a `LogsClientService.registerLog` con nivel INFO de forma asíncrona. El interceptor debe evitar registrar logs para peticiones que ya generaron errores (verificar que no haya excepciones).",
      "command": "/generate",
      "params": {
        "target_file": "src/main/java/trinity/play2learn/backend/configs/logs/interceptors/SuccessfulRequestLoggingInterceptor.java"
      },
      "status": "done",
      "acceptance_criteria": [
        "El archivo `src/main/java/trinity/play2learn/backend/configs/logs/interceptors/SuccessfulRequestLoggingInterceptor.java` existe e implementa `HandlerInterceptor`.",
        "El interceptor implementa `afterCompletion` para capturar peticiones exitosas (status 2xx).",
        "El interceptor extrae información relevante: URL, método HTTP, status code, tiempo de respuesta.",
        "El interceptor llama a `LogsClientService.registerLog` con nivel INFO de forma asíncrona.",
        "El interceptor incluye JavaDoc completo explicando su propósito y comportamiento."
      ]
    },
    {
      "id": "T02",
      "title": "Configurar interceptor en WebMvcConfigurer",
      "description": "Crear o actualizar configuración de WebMvc para registrar el `SuccessfulRequestLoggingInterceptor`. Si existe un archivo de configuración de WebMvc, agregar el interceptor allí. Si no existe, crear `LogsInterceptorConfig` que implemente `WebMvcConfigurer` y registre el interceptor. El interceptor debe aplicarse a todas las rutas excepto posiblemente rutas de health checks o rutas estáticas si es necesario. Seguir el patrón existente del proyecto (similar a `ArgumentSolversConfig`).",
      "command": "/generate",
      "params": {
        "target_file": "src/main/java/trinity/play2learn/backend/configs/logs/configs/LogsInterceptorConfig.java"
      },
      "status": "done",
      "acceptance_criteria": [
        "El archivo de configuración existe y registra el `SuccessfulRequestLoggingInterceptor`.",
        "El interceptor está configurado para aplicarse a todas las rutas REST (o rutas específicas según necesidad).",
        "La configuración sigue el patrón existente del proyecto usando `WebMvcConfigurer`.",
        "La configuración incluye JavaDoc explicando su propósito."
      ]
    },
    {
      "id": "T03",
      "title": "Refinar interceptor y configuración",
      "description": "Mejorar el código del interceptor y la configuración agregando: mejor manejo de edge cases (request null, response null, etc.), filtrado opcional de rutas específicas si es necesario (por ejemplo, health checks), mejor extracción de información del usuario si está disponible, optimización del cálculo de tiempo de respuesta, y mejor documentación JavaDoc. Asegurar que el código cumple con estándares de estilo del proyecto.",
      "command": "/refine",
      "params": {
        "targets": [
          "src/main/java/trinity/play2learn/backend/configs/logs/interceptors/SuccessfulRequestLoggingInterceptor.java",
          "src/main/java/trinity/play2learn/backend/configs/logs/configs/LogsInterceptorConfig.java"
        ]
      },
      "status": "done",
      "acceptance_criteria": [
        "El código maneja edge cases apropiadamente (null checks, validaciones).",
        "El código incluye JavaDoc completo y detallado.",
        "El código cumple con estándares de estilo y mejores prácticas de Spring.",
        "El interceptor es eficiente y no afecta el rendimiento de las peticiones."
      ]
    },
    {
      "id": "T04",
      "title": "Escribir pruebas unitarias para SuccessfulRequestLoggingInterceptor",
      "description": "Crear suite de pruebas `SuccessfulRequestLoggingInterceptorTest` cubriendo: interceptación de peticiones exitosas (2xx) con verificación de llamada a LogsClientService, verificación de metadata enviada (URL, método HTTP, status code, tiempo de respuesta), verificación de nivel INFO en el log, no registro de logs para peticiones con errores (4xx, 5xx), no registro de logs cuando hay excepciones, manejo de edge cases (request null, response null), verificación de que el registro es asíncrono (no bloquea), y diferentes métodos HTTP (GET, POST, PUT, DELETE). Los tests deben usar `@ExtendWith(MockitoExtension.class)`, mocks apropiados, y seguir patrón Given-When-Then con `@Nested` y `@DisplayName`.",
      "command": "/generate",
      "params": {
        "target_file": "src/test/java/trinity/play2learn/backend/configs/logs/interceptors/SuccessfulRequestLoggingInterceptorTest.java"
      },
      "status": "done",
      "acceptance_criteria": [
        "La suite `SuccessfulRequestLoggingInterceptorTest` existe y cubre todos los escenarios críticos mencionados.",
        "Los tests usan `@Nested`, `@DisplayName` con patrón Given-When-Then y mocks apropiados.",
        "Los tests verifican comportamiento asíncrono y no bloqueante del interceptor.",
        "Los tests cubren edge cases y diferentes métodos HTTP.",
        "Todos los tests pasan exitosamente con cobertura ≥ 85%."
      ]
    },
    {
      "id": "T05",
      "title": "Refinar pruebas unitarias",
      "description": "Revisar y mejorar suite de pruebas agregando helpers reutilizables si es necesario, mejorando legibilidad, asegurando cobertura completa sin duplicar código, y mejorando documentación de tests con comentarios Given-When-Then más detallados.",
      "command": "/refine",
      "params": {
        "targets": [
          "src/test/java/trinity/play2learn/backend/configs/logs/interceptors"
        ]
      },
      "status": "done",
      "acceptance_criteria": [
        "Los tests usan fixtures compartidos y helpers reutilizables donde corresponde.",
        "Cada escenario documenta explícitamente el motivo de la validación esperada.",
        "La cobertura incluye casos límite sin duplicar código.",
        "Todos los tests mantienen patrón Given-When-Then con documentación clara."
      ]
    },
    {
      "id": "T06",
      "title": "Ejecutar pruebas y verificar cobertura",
      "description": "Ejecutar todas las suites de pruebas del módulo de logs (incluyendo el nuevo interceptor) con JaCoCo para verificar que todos los tests pasan y la cobertura cumple con los criterios establecidos.",
      "command": "/test",
      "params": {
        "command": "./mvnw.cmd org.jacoco:jacoco-maven-plugin:prepare-agent test org.jacoco:jacoco-maven-plugin:report -Dtest=trinity.play2learn.backend.configs.logs.**"
      },
      "status": "done",
      "acceptance_criteria": [
        "El comando finaliza sin errores y produce `target/site/jacoco/index.html` actualizado.",
        "Cobertura de interceptores/servicios alcanza ≥ 85% en líneas y ≥ 75% en ramas.",
        "Todas las suites de pruebas pasan exitosamente (0 fallos, 0 errores)."
      ]
    }
  ]
}

